# Текст для стартового меню
START_TEXT = "👋 Приветствую тебя в боте для генерации изображений! Чтобы начать работу, тебе нужно всёго-лишь отправить свой промпт:"

# Текст при получении промпта
GET_PROMPT_SUCCESS_TEXT = "Промпт успешно получен! Произвожу отправку запросов на генерацию изображений..."

# Текст при получении id работы
GENERATE_IMAGES_PROCESS_TEXT = """
✅ Успешно: {} 
❌ Ошибка: {}
⚡️ В процессе: {}
⏳ В очереди: {}

🖼 Происходит генерация изображений...
"""

# Текст при успешной генерации изображения
GENERATE_IMAGE_SUCCESS_TEXT = "Изображения успешно сгенерированы! ✅ \n\nТеперь отправь мне название папки для сохранения изображений:"
